ramangopalan/madure/src/platform/stm32/platform_conf.h
// picoc platform configuration

#ifndef __PLATFORM_CONF_H__
#define __PLATFORM_CONF_H__

#include "type.h"
#include "stacks.h"
#include "stm32f10x.h"
#include "mybasic_int.h"
#include "sermux.h"


// *****************************************************************************
// Define here what components you want for this platform

#define BUILD_SHELL
//#define BUILD_LINENOISE
//#define BUILD_ROMFS
#define BUILD_MMCFS
#define BUILD_EDITOR_IV
#define BUILD_TERM
#define BUILD_CON_GENERIC
#define BUILD_ADC
#define BUILD_CAN
#define BUILD_C_INT_HANDLERS

// *****************************************************************************
// UART/Timer IDs configuration data (used in main.c)

#define CON_UART_ID           0
#define CON_UART_SPEED        115200
#define CON_TIMER_ID          0
#define TERM_LINES            25
#define TERM_COLS             80

// *****************************************************************************
// Configuration data

#define EGC_INITIAL_MODE      1

// Virtual timers (0 if not used)
#define VTMR_NUM_TIMERS       4
#define VTMR_FREQ_HZ          10

// Number of resources (0 if not available/not implemented)
#define NUM_PIO               7
#define NUM_SPI               2
#define NUM_UART              5
#define NUM_TIMER             5
#define NUM_PWM               4
#define NUM_ADC               16
#define NUM_CAN               1

// Enable RX buffering on UART
#define BUF_ENABLE_UART
#define CON_BUF_SIZE          BUF_SIZE_128

// ADC Configuration Params
#define ADC_BIT_RESOLUTION    12
#define BUF_ENABLE_ADC
#define ADC_BUF_SIZE          BUF_SIZE_2

// These should be adjusted to support multiple ADC devices
#define ADC_TIMER_FIRST_ID    0
#define ADC_NUM_TIMERS        4

// RPC boot options
#define RPC_UART_ID           CON_UART_ID
#define RPC_TIMER_ID          CON_TIMER_ID
#define RPC_UART_SPEED        CON_UART_SPEED

// MMCFS Support (FatFs on SD/MMC)
// For STM32F103RET6 - PA5 = CLK, PA6 = MISO, PA7 = MOSI, PA8 = CS
#define MMCFS_TICK_HZ         10
#define MMCFS_TICK_MS         ( 1000 / MMCFS_TICK_HZ )
#define MMCFS_CS_PORT         0
#if defined (PICOC_CPU_STM32F103VCT6)
# define MMCFS_CS_PIN         4
#else
# define MMCFS_CS_PIN         8
#endif
#define MMCFS_SPI_NUM         0

// CPU frequency (needed by the CPU module, 0 if not used)
u32 platform_s_cpu_get_frequency();
#define CPU_FREQUENCY         platform_s_cpu_get_frequency()

// PIO prefix ('0' for P0, P1, ... or 'A' for PA, PB, ...)
#define PIO_PREFIX            'A'
// Pins per port configuration:
// #define PIO_PINS_PER_PORT (n) if each port has the same number of pins, or
// #define PIO_PIN_ARRAY { n1, n2, ... } to define pins per port in an array
// Use #define PIO_PINS_PER_PORT 0 if this isn't needed
#define PIO_PINS_PER_PORT     16

// Remote file system data
#define RFS_BUFFER_SIZE       BUF_SIZE_512
#define RFS_UART_ID           0
#define RFS_TIMER_ID          0
#define RFS_TIMEOUT           100000
#define RFS_UART_SPEED        115200

// Linenoise buffer sizes
#define LINENOISE_HISTORY_SIZE_PICOC  50
#define LINENOISE_HISTORY_SIZE_SHELL  10

// Allocator data: define your free memory zones here in two arrays
// (start address and end address)
#define SRAM_SIZE             (64 * 1024)
#define MEM_START_ADDRESS     {(void *)end}
#define MEM_END_ADDRESS       {(void *)(SRAM_BASE + SRAM_SIZE - STACK_SIZE_TOTAL - 1)}

// Interrupt queue size
#define PLATFORM_INT_QUEUE_LOG_SIZE 5

// Interrupt list
#define INT_TMR_MATCH         PICOC_INT_FIRST_ID
#define INT_UART_RX           (PICOC_INT_FIRST_ID + 1)
#define INT_PICOC_LAST        INT_UART_RX

#endif // #ifndef __PLATFORM_CONF_H__
